In [ ]:
1.
#x = df['dataset'] == 'IV'
#df[x]
2.
df.query("dataset == 'IV'") # Query the columns of a DataFrame with a boolean expression. Same as above

In [ ]:
# useful when a column have multiple values like [master,bachelor,phd] and we want to only shows the rows that have bachelor
# degree column  , same like is in
bach = df['parent'] == "bachelor's degree"
df[bach].head(3)

In [ ]:
# column "movies" have seral movies names , but we want only whose name/text in movies column starts with "james"
# mean james bond movies .
free = df['movies'].str.contains(r'james.*')
df[free].head(3)

In [ ]:
# To get only movies which are 90s in "release_yr" column
nintees = df['release_yr'].between(1990,1999)
df[nintees].head(3)

In [ ]:
# To apply all the conditions above "bachelor degree holder james movies of 90s"
df[bach & free & nintees].sort_values('release_yr').head(3)

In [ ]:
# check total number of unique values of all 'object' type columns
Sd.select_dtypes('object').nunique()

In [ ]:
# To convert 'ca' object type column to int type column
heart['ca'] = pd.to_numeric(heart['ca'])

In [ ]:
# replace with 'NaN' value , in all DataFrame (not column specific)
heart = heart.replace('?', np.nan)

In [ ]:
# Useful command to get a subset based on multiple conditions enclosed in ().
tips[(tips.day == 'Fri') & (tips.smoker == 'No')]
# To get box plot of same sunbset above.
tips[(tips.day == 'Sat') & (tips.smoker == 'No')].boxplot(color = dict(medians = 'Darkblue'), showmeans = True)
# to describe a column of same subset above.
tips[(tips.day == 'Sat') & (tips.smoker == 'No')].total_bill.describe()

# Visualization

In [ ]:
# realy useful command to save the image of graph
plt.savefig('img.png')

# Ways to filter Data

In [2]:
import pandas as pd
import numpy as np

In [18]:
df = pd.DataFrame({ 'name' : ['ali' , 'csad' , 'dmana' , ' bhmad' ] , 'city' : ['A' , 'B' , 'C' , 'D'],
                     'var' : np.random.random(size = 4) , 'var2' : np.random.randint(100,300,4)})
df

     name city       var  var2
0     ali    A  0.841058   264
1    csad    B  0.649704   156
2   dmana    C  0.970659   281
3   bhmad    D  0.019309   133

In [19]:
#1 . Logical operatiors
df[df['var2'] > 200]

    name city       var  var2
0    ali    A  0.841058   264
2  dmana    C  0.970659   281

In [21]:
df[df['name'] > 'ali']

    name city       var  var2
1   csad    B  0.649704   156
2  dmana    C  0.970659   281

In [27]:
#2. Mutiple logical operatiors
df[(df['name'] > 'ali') & ((df['var2'] > 264) | (df['var'] > 0.64)) ]

    name city       var  var2
1   csad    B  0.649704   156
2  dmana    C  0.970659   281

In [28]:
#3. isin
l1 = ['ali' , 'dmana']
l2 = [156 , 281]
df[df['var2'].isin(l2)]

    name city       var  var2
1   csad    B  0.649704   156
2  dmana    C  0.970659   281

In [29]:
#4. str() method
df[df['name'].str.startswith('c')]

   name city       var  var2
1  csad    B  0.649704   156

In [30]:
df[df['name'].str.endswith('i')]

  name city       var  var2
0  ali    A  0.841058   264

In [36]:
df[df['name'].str.contains(r'sa.*')]

   name city       var  var2
1  csad    B  0.649704   156

In [37]:
#5. Tilde (~) sign
df[~df['name'].str.contains(r'sa.*')]

     name city       var  var2
0     ali    A  0.841058   264
2   dmana    C  0.970659   281
3   bhmad    D  0.019309   133

In [49]:
#6. query
df.query("name > 'ali' & (var2 > 150 & var < 0.95)")

   name city       var  var2
1  csad    B  0.649704   156

In [50]:
#7. nlargest()
df.nlargest(1,'var2')

    name city       var  var2
2  dmana    C  0.970659   281

In [52]:
df['var2'].nlargest(1)

2    281
Name: var2, dtype: int32

In [53]:
df.nsmallest(1,'var2')

     name city       var  var2
3   bhmad    D  0.019309   133

In [60]:
df.index = ['a' , 'b' , 'c' , 'd']
df.index[2]

'c'

In [61]:
df

     name city       var  var2
a     ali    A  0.841058   264
b    csad    B  0.649704   156
c   dmana    C  0.970659   281
d   bhmad    D  0.019309   133